In [1]:
import pandas as pd
import numpy as np

In [11]:
df1=pd.read_csv('D:/data/train-left-up.csv')
df1.head()

,PassengerId,Survived,Pclass,Name
0,1,0,3,"Braund, Mr. Owen Harris"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
2,3,1,3,"Heikkinen, Miss. Laina"
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)"
4,5,0,3,"Allen, Mr. William Henry"

In [12]:
df2=pd.read_csv('D:/data/train-right-up.csv')
df2.head()

      Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0    male  22.0    1.0    0.0         A/5 21171   7.2500   NaN        S
1  female  38.0    1.0    0.0          PC 17599  71.2833   C85        C
2  female  26.0    0.0    0.0  STON/O2. 3101282   7.9250   NaN        S
3  female  35.0    1.0    0.0            113803  53.1000  C123        S
4    male  35.0    0.0    0.0            373450   8.0500   NaN        S

In [35]:
df1.merge(df2, left_index=True, right_index=True)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
434,435,0,1,"Silvey, Mr. William Baird",male,50.0,1.0,0.0,13507,55.9000,E44,S
435,436,1,1,"Carter, Miss. Lucile Polk",female,14.0,1.0,2.0,113760,120.0000,B96 B98,S
436,437,0,3,"Ford, Miss. Doolina Margaret ""Daisy""",female,21.0,2.0,2.0,W./C. 6608,34.3750,NaN,S
437,438,1,2,"Richards, Mrs. Sidney (Emily Hocking)",female,24.0,2.0,3.0,29106,18.7500,NaN,S
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1.0,4.0,19950,263.0000,C23 C25 C27,S

In [13]:
df3=pd.read_csv('D:/data/train-left-down.csv')
df3.head()

   PassengerId  Survived  Pclass                                         Name
0          440         0       2       Kvillner, Mr. Johan Henrik Johannesson
1          441         1       2  Hart, Mrs. Benjamin (Esther Ada Bloomfield)
2          442         0       3                              Hampe, Mr. Leon
3          443         0       3                    Petterson, Mr. Johan Emil
4          444         1       2                    Reynaldo, Ms. Encarnacion

In [14]:
df4=pd.read_csv('D:/data/train-right-down.csv')
df4.head()

      Sex   Age  SibSp  Parch        Ticket    Fare Cabin Embarked
0    male  31.0      0      0    C.A. 18723  10.500   NaN        S
1  female  45.0      1      1  F.C.C. 13529  26.250   NaN        S
2    male  20.0      0      0        345769   9.500   NaN        S
3    male  25.0      1      0        347076   7.775   NaN        S
4  female  28.0      0      0        230434  13.000   NaN        S

In [43]:
DF1=pd.concat([df1,df2], axis=1)
DF1.to_csv('D:/data/result_up.csv')
DF1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  439 non-null    float64
 1   Survived     439 non-null    float64
 2   Pclass       439 non-null    float64
 3   Name         439 non-null    object
 4   Sex          868 non-null    object
 5   Age          696 non-null    float64
 6   SibSp        868 non-null    float64
 7   Parch        868 non-null    float64
 8   Ticket       868 non-null    object
 9   Fare         868 non-null    float64
 10  Cabin        197 non-null    object
 11  Embarked     866 non-null    object
dtypes: float64(7), object(5)
memory usage: 83.7+ KB

In [27]:
df1.join(df2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
434,435,0,1,"Silvey, Mr. William Baird",male,50.0,1.0,0.0,13507,55.9000,E44,S
435,436,1,1,"Carter, Miss. Lucile Polk",female,14.0,1.0,2.0,113760,120.0000,B96 B98,S
436,437,0,3,"Ford, Miss. Doolina Margaret ""Daisy""",female,21.0,2.0,2.0,W./C. 6608,34.3750,NaN,S
437,438,1,2,"Richards, Mrs. Sidney (Emily Hocking)",female,24.0,2.0,3.0,29106,18.7500,NaN,S
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1.0,4.0,19950,263.0000,C23 C25 C27,S

In [22]:
DF2=pd.concat([df3,df4],axis=1)
DF2.head()
DF2.to_csv('D:/data/result_down.csv')

In [25]:
DF3=pd.concat([DF1,DF2])
DF3.to_csv('D:/data/result.csv')

In [28]:
DF1.append(DF2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3.0,1.0,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
3,4.0,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5.0,0.0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
447,887.0,0.0,2.0,"Montvila, Rev. Juozas",male,27.0,0.0,0.0,211536,13.0000,NaN,S
448,888.0,1.0,1.0,"Graham, Miss. Margaret Edith",female,19.0,0.0,0.0,112053,30.0000,B42,S
449,889.0,0.0,3.0,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2.0,W./C. 6607,23.4500,NaN,S
450,890.0,1.0,1.0,"Behr, Mr. Karl Howell",male,26.0,0.0,0.0,111369,30.0000,C148,C
451,891.0,0.0,3.0,"Dooley, Mr. Patrick",male,32.0,0.0,0.0,370376,7.7500,NaN,Q

Pandas 数据轴旋转：
1.stack：将数据的列“旋转”为行   e.g.: df.stack()
2.unstack：将数据的行“旋转”为列

将Dataframe数据转化为Series类型

In [44]:
ts=pd.read_csv('D:/data/result.csv')
ts.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,1,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,2,3.0,1.0,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
3,3,4.0,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,4,5.0,0.0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S

In [55]:
ts_rev=ts.stack()
ts_rev.head()

0  Unnamed: 0                           0
   PassengerId                          1
   Survived                             0
   Pclass                               3
   Name           Braund, Mr. Owen Harris
dtype: object

In [56]:
ts_rev.to_csv('D:/data/rev_result.csv')
test=pd.read_csv('D:/data/rev_result.csv')
test.head()

   Unnamed: 0   Unnamed: 1                        0
0           0   Unnamed: 0                        0
1           0  PassengerId                      1.0
2           0     Survived                      0.0
3           0       Pclass                      3.0
4           0         Name  Braund, Mr. Owen Harris

数据聚合和运算

数据分类 Group by
Group DataFrame using a mapper or by a Series of columns.
A groupby operation involves some combination of splitting the object, applying a function, and combining the results. This can be used to group large amounts of data and compute operations on these groups.

DataFrame.groupby(by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, squeeze=<object object>, observed=False, dropna=True)

groupby() 常与sum(), mean()一起使用

In [73]:
df_fare=df['Fare'].groupby(df['Sex'])
means=df_fare.mean()
print (means)

Sex
female    44.817937
male      25.592458
Name: Fare, dtype: float64

In [77]:
df_survival=df['Survived'].groupby(df['Sex'])
total=df_survival.sum()
print (total)

Sex
female    233.0
male      109.0
Name: Survived, dtype: float64

In [78]:
df_survival_level=df['Survived'].groupby(df['Pclass']).sum()
print (df_survival_level)

Pclass
1.0    136.0
2.0     87.0
3.0    119.0
Name: Survived, dtype: float64

聚合函数 agg()
聚合函数操作始终是在轴（默认是列轴，也可设置行轴）上执行! 不同于numpy聚合函数。

In [84]:
df['Sex']=df['Sex'].map({'male':0, 'female':1})
df.groupby('Survived').agg({'Sex': 'mean', 'Pclass': 'count'}).rename(columns={'Sex': 'mean_sex', 'Pclass': 'count_pclass'})

          mean_sex  count_pclass
Survived
0.0       0.147541           549
1.0       0.681287           342

In [85]:
#统计在不同等级的票中的不同年龄的船票花费的平均值
df.groupby(['Pclass','Age'])['Fare'].mean().head()

Pclass  Age
1.0     0.92     151.5500
        2.00     151.5500
        4.00      81.8583
        11.00    120.0000
        14.00    120.0000
Name: Fare, dtype: float64

In [89]:
df_sur_new=pd.merge(means,total,on='Sex')        #on要加入的列或索引级别名称。 必须在左侧和右侧DataFrame对象中找到。
df_sur_new.head()

             Fare  Survived
Sex
female  44.817937     233.0
male    25.592458     109.0

In [90]:
df_sur_new.to_csv('D:/data/sex_fare_survived.csv')

In [92]:
df_survival_age=df['Survived'].groupby(df['Age']).sum()
df_survival_age.head()

Age
0.42    1.0
0.67    1.0
0.75    2.0
0.83    2.0
0.92    1.0
Name: Survived, dtype: float64

In [93]:
#找出最大值的年龄段
df_survival_age[df_survival_age.values==df_survival_age.max()]

Age
24.0    15.0
Name: Survived, dtype: float64

In [95]:
df_survival_sum=df['Survived'].sum()
df_survival_percentage=df_survival_age.max()/df_survival_sum
print ('最大存活率为'+ str(df_survival_percentage))

最大存活率为0.043859649122807015